# set arguments for all 'brew install --cask' commands
# cask_args appdir: "~/Applications", require_sha: true

# Core utilities and system tools
brew 'bat'
brew 'ctop'
brew 'direnv'
brew 'gotop'
brew 'graphviz'
brew 'gum'
brew 'htop'
brew 'jq'
brew 'qrencode'
brew 'smartmontools'
brew 'starship'
brew 'step'
brew 'telnet'
brew 'tree'
brew 'wget'
brew 'yq'
brew 'zellij'
brew 'fzf'

# Security and encryption tools
brew 'age'
brew 'mkcert'
brew 'sops'
brew 'ssss'

# Cloud/DevOps tools
brew 'ansible'
brew 'aws-iam-authenticator'
brew 'aws-sam-cli'
brew 'awscli'
brew 'chezmoi'
brew 'hadolint'
brew 'helm'
brew 'kubectx'
brew 'hey'
brew 'jsonnet'
brew 'just'
brew 'k3d'
brew 'k9s'
brew 'kind'
brew 'kube-linter'
brew 'kubeseal'
brew 'kustomize'
brew 'linkerd'
brew 'minikube'
brew 'oci-cli'
brew 'opa'
brew 'pre-commit'
brew 'quarkusio/tap/quarkus'
brew 'symfony-cli/tap/symfony-cli'
brew 'tenv'
brew 'txn2/tap/kubefwd'


# Programming languages and runtimes
brew 'go'
brew 'node'
brew 'php@8.4'
brew 'rust'
brew 'oven-sh/bun/bun'
brew 'ruby'

# Development tools and package managers
brew 'composer'
brew 'php-cs-fixer'
brew 'pnpm'
brew 'yarn'
brew 'uv'

## Font Family: Nerd Font
cask 'font-roboto-mono-nerd-font'
cask 'font-mononoki-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-hack-nerd-font'



# Failing to install on Fedora 42
# Stripe formula only macOS
# brew 'stripe/stripe-cli/stripe'
# brew 'teamookla/speedtest/speedtest'
# brew 'wagoodman/dive/dive'

# Ubuntu font
# cask 'homebrew/cask-fonts/font-ubuntu-mono-nerd-font'
