
# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew 'age'
brew 'ansible'
brew 'argocd-autopilot'
brew 'aws-iam-authenticator'
brew 'aws/tap/aws-sam-cli'
brew 'awscli'
brew 'bat'
brew 'btop'
brew 'chezmoi'
brew 'circleci'
brew 'composer'
brew 'ctop'
brew 'direnv'
brew 'go'
brew 'gotop'
brew 'gradle'
brew 'graphviz'
brew 'gum'
brew 'hadolint'
brew 'helix'
brew 'helm'
brew 'hey'
brew 'htop'
brew 'hugo'
brew 'jq'
brew 'jsonnet'
brew 'just'
brew 'k3d'
brew 'k9s'
brew 'kind'
brew 'kube-linter'
brew 'kubeseal'
brew 'kustomize'
brew 'minikube'
brew 'mkcert'
brew 'mysql-client'
brew 'node'
brew 'oci-cli'
brew 'opa'
brew 'packer'
brew 'php-cs-fixer'
brew 'php@8.1'
brew 'pre-commit'
brew 'qrencode'
brew 'quarkusio/tap/quarkus'
brew 'smartmontools'
brew 'sops'
brew 'ssss'
brew 'starship'
brew 'stripe/stripe-cli/stripe'
brew 'symfony-cli/tap/symfony-cli'
brew 'teamookla/speedtest/speedtest'
brew 'telnet'
brew 'terragrunt'
brew 'tfenv'
brew 'tfmigrate'
brew 'tree'
brew 'txn2/tap/kubefwd'
brew 'wagoodman/dive/dive'
brew 'wget'
brew 'yarn'
brew 'yq'
brew 'zellij'


## Font Family: Nerd Font
cask 'homebrew/cask-fonts/font-ubuntu-mono-nerd-font'
cask 'homebrew/cask-fonts/font-roboto-mono-nerd-font'
cask 'homebrew/cask-fonts/font-mononoki-nerd-font'
cask 'homebrew/cask-fonts/font-jetbrains-mono-nerd-font'
cask 'homebrew/cask-fonts/font-inconsolata-nerd-font'
cask 'homebrew/cask-fonts/font-hack-nerd-font'